heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf_working/proprietary_rf_working/esb_prx/main.c
          }
          if(circlearr[8] == 1  && circlearr[4] == 1)
          {
                advertisment_pcket.circle_no = Current_Circle;
                advertisment_pcket.node_id = addr_prefix[0];
                memset(&header,0,sizeof(header));
                header.packet_type = 1;
                if(circlearr[Current_Circle - 1] != 0 && Current_Circle != 0)
                {
                      header.Direction = 0;
                }
                else
                {
                      header.Direction = 1;
                }
                memcpy(tx_payload.data,&header,sizeof(header));
                memcpy(tx_payload.data + sizeof(header), &advertisment_pcket, sizeof(advertisment_pcket));
                tx_payload.length = sizeof(header) + sizeof(advertisment_pcket);
                check_direction(tx_payload.data);
          }
}


void clocks_start( void )
{
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0);
}


void gpio_init( void )
{
    bsp_board_init(BSP_INIT_LEDS);
}

void nrf_set_txmode(void)
{
    uint32_t err_code;
     nrf_esb_config_t nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
    nrf_esb_config.payload_length           = 252;
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    nrf_esb_config.selective_auto_ack       = false;

    err_code = nrf_esb_init(&nrf_esb_config);
    //VERIFY_SUCCESS(err_code);
}


void scan_device(uint8_t length)
{
    uint8_t i, k = 0, l = 0;
 
     for(i = 0 ;i <= 0xFF ; i++)
     {
          NRF_LOG_DEBUG("Transmitting packet %02x", tx_payload.data[1]);
          NRF_LOG_FLUSH();
 
          tx_payload.noack = false;
          if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
          {
              nrf_gpio_pin_write(LED_1, !(tx_payload.data[1]%8>0 && tx_payload.data[1]%8<=4));
              nrf_gpio_pin_write(LED_2, !(tx_payload.data[1]%8>1 && tx_payload.data[1]%8<=5));
              nrf_gpio_pin_write(LED_3, !(tx_payload.data[1]%8>2 && tx_payload.data[1]%8<=6));
              nrf_gpio_pin_write(LED_4, !(tx_payload.data[1]%8>3));
              tx_payload.data[1]++;
          }
          else
          {
              NRF_LOG_INFO("Sending packet failed");
              NRF_LOG_FLUSH();
          }
 
          nrf_delay_us(50000);

 
          if(Ack_Txing == 1)
          {
              Ack_Txing = 0;
              Actd[k++] = i;
          }
 
         if(k >= length)
         {
            break;
         }

          set_slave_adress(i, arrays[Current_Circle - 1]);
     }
 
     NRF_LOG_INFO("Scan done");
     NRF_LOG_FLUSH();
 
}


uint32_t esb_init( void )
{

    uint32_t err_code;

    nrf_esb_config_t nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.retransmit_delay         = 600;
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    nrf_esb_config.selective_auto_ack       = false;


    err_code = nrf_esb_init(&nrf_esb_config);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_0(arrays[Current_Circle]);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(addr_prefix, 1);
    VERIFY_SUCCESS(err_code);

    return err_code;
}

uint32_t set_slave_adress(uint8_t slaveid,uint8_t *base_address)
{

    uint32_t err_code;

    err_code = nrf_esb_set_base_address_0(base_address);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(&slaveid, 1);
    VERIFY_SUCCESS(err_code);
    nrf_esb_flush_tx();
    nrf_esb_flush_rx();


    return err_code;
}

#define	POW_CNTRL_PIN	7
uint8_t autohealing = 0;
uint8_t Diagnostic_Test = 0;

void doDiagnosticTest(void)
{       
          Nxt_table_index = 0;
          Prev_table_index = 0;
          uint8_t done_rx_start = 1;
          if(Current_Circle == MIN_CIRCLE)
          {

                for(neighbour_no = 0; neighbour_no < 255 ;)
                {

                        if(Ack_Txing == 0)
                        {
                              nrf_esb_stop_rx();
                              set_slave_adress( neighbour_no ,arrays[Current_Circle + 1]);
                              memset(&header,0,sizeof(header));
                              header.packet_type = 1;
                              header.length = 1;
                              header.circle_array[Current_Circle] = addr_prefix[0];
                              memcpy(tx_payload.data,&header,sizeof(header));
                              memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                              tx_payload.length = (sizeof(header) + sizeof("HAI"));
                              done_rx_start = 1;
                              if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                              {
                                    nrf_delay_us(50000); //to send the data 
                                    //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);

                              }
                        }
                        else if(done_rx_start == 1)
                        {
                              done_rx_start = 0;
                              //   nrf_esb_flush_tx();
                              //  nrf_esb_flush_rx();
                              set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                              nrf_esb_start_rx();
                        }

